-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: i9a606.p.ssafy.io    Database: jansori
-- ------------------------------------------------------
-- Server version	8.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `nag`
--

DROP TABLE IF EXISTS `nag`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `nag` (
  `nag_id` bigint NOT NULL AUTO_INCREMENT,
  `created_at` datetime(6) DEFAULT NULL,
  `modified_at` datetime(6) DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `like_count` int DEFAULT NULL,
  `preview` varchar(255) DEFAULT NULL,
  `member_id` bigint DEFAULT NULL,
  `tag_id` bigint DEFAULT NULL,
  PRIMARY KEY (`nag_id`),
  KEY `FKe2jrlynnhyfkqs18rjud6wfcm` (`member_id`),
  KEY `FKo0e7vm7tlgodvmfhwih1w9rl5` (`tag_id`),
  CONSTRAINT `FKe2jrlynnhyfkqs18rjud6wfcm` FOREIGN KEY (`member_id`) REFERENCES `member` (`member_id`),
  CONSTRAINT `FKo0e7vm7tlgodvmfhwih1w9rl5` FOREIGN KEY (`tag_id`) REFERENCES `tag` (`tag_id`)
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `nag`
--

LOCK TABLES `nag` WRITE;
/*!40000 ALTER TABLE `nag` DISABLE KEYS */;
INSERT INTO `nag` VALUES (1,'2023-08-17 14:48:19.037130','2023-08-17 14:48:19.037130','\'운동은 시작이 반!\'...니 시작은 언제니?',256,'\'ㅇㄷㅇ ㅅㅈㅇ ㅂ!\'...ㄴ ㅅㅈㅇ ㅇㅈㄴ?',18,1),(2,'2023-08-17 14:48:19.046177','2023-08-17 14:48:19.046177','혼자 고민하지 말고... 또 혼자 먹방하니?',586,'ㅎㅈ ㄱㅁㅎㅈ ㅁㄱ... ㄸ ㅎㅈ ㅁㅂㅎㄴ?',15,45),(3,'2023-08-17 14:48:19.047417','2023-08-17 14:48:19.047417','\'Hello, World!\' 또 인사만 하고 끝이야?',207,'\'_e__o, _o___!\' ㄸ ㅇㅅㅁ ㅎㄱ ㄲㅇㅇ?',19,47),(4,'2023-08-17 14:48:19.048609','2023-08-17 14:48:19.048609','\'Less is More\' 하지만 너네 눈에만 보이는 그 \'Less\'가 뭐야?',44,'\'_e__ i_ _o_e\' ㅎㅈㅁ ㄴㄴ ㄴㅇㅁ ㅂㅇㄴ ㄱ \'_e__\'ㄱ ㅁㅇ?',2,48),(5,'2023-08-17 14:48:19.049642','2023-08-17 14:48:19.049642','토끼가 되는 길을 걷는 중입니다.',92,'ㅌㄲㄱ ㄷㄴ ㄱㅇ ㄱㄴ ㅈㅇㄴㄷ.',12,50),(6,'2023-08-17 14:48:19.050641','2023-08-17 14:48:19.050641','\'Life is what happens while you\'re busy making other plans.\' 오늘도 계획만 세우고 지냈나?',115,'\'_i_e i_ __a_ _a__e__ __i_e _ou\'_e _u__ _a_i__ o__e_ __a__.\' ㅇㄴㄷ ㄱㅎㅁ ㅅㅇㄱ ㅈㄴㄴ?',4,52),(7,'2023-08-17 14:48:19.051751','2023-08-18 04:25:57.508036','\'Insanity is doing the same thing over and over and expecting different results.\' 넌 또 뭐 반복했어?',931,'\'I__a_i__ i_ _oi__ __e _a_e __i__ o_e_ a__ o_e_ a__ e__e__i__ _i__e_e__ _e_u___.\' ㄴ ㄸ ㅁ ㅂㅂㅎㅇ?',11,54),(8,'2023-08-17 14:48:19.052711','2023-08-17 14:48:19.052711','무릎팍도사야? 맨날 도전만 하네',412,'ㅁㄹㅍㄷㅅㅇ? ㅁㄴ ㄷㅈㅁ ㅎㄴ',16,74),(9,'2023-08-17 14:48:19.053847','2023-08-18 09:13:43.686564','넌 게임 속의 주인공, 아니... NPC야?',1024,'ㄴ ㄱㅇ ㅅㅇ ㅈㅇㄱ, ㅇㄴ... ___ㅇ?',13,78),(10,'2023-08-17 14:48:19.054807','2023-08-17 14:48:19.054807','먹고 죽은 귀신이 때깔도 곱다.',397,'ㅁㄱ ㅈㅇ ㄱㅅㅇ ㄸㄲㄷ ㄱㄷ.',14,81),(11,'2023-08-17 14:48:19.055697','2023-08-17 14:48:19.055697','혼자서 먹으면 0칼로리... 믿기지 않아?',684,'ㅎㅈㅅ ㅁㅇㅁ 0ㅋㄹㄹ... ㅁㄱㅈ ㅇㅇ?',12,82),(12,'2023-08-17 14:48:19.056570','2023-08-18 04:25:58.282464','\'Fashion fades, style is eternal.\' 오늘도 패션 실험중이야?',903,'\'_a__io_ _a_e_, ____e i_ e_e__a_.\' ㅇㄴㄷ ㅍㅅ ㅅㅎㅈㅇㅇ?',2,84),(13,'2023-08-17 14:48:19.057496','2023-08-18 04:25:59.159970','\'Stop and smell the roses.\' 하지만 넌 또 무슨 꽃인지도 모르고 지나쳤을테지',754,'\'__o_ a__ __e__ __e _o_e_.\' ㅎㅈㅁ ㄴ ㄸ ㅁㅅ ㄲㅇㅈㄷ ㅁㄹㄱ ㅈㄴㅊㅇㅌㅈ',10,110),(14,'2023-08-17 14:48:19.058442','2023-08-18 04:25:56.823304','죽을 때까지 챕터1 반복 예정',1012,'ㅈㅇ ㄸㄲㅈ ㅊㅌ1 ㅂㅂ ㅇㅈ',3,3),(15,'2023-08-17 14:48:19.059413','2023-08-18 01:27:17.473172','이러다간 두피 마사지만 하다가 인생이 끝날거야...',350,'ㅇㄹㄷㄱ ㄷㅍ ㅁㅅㅈㅁ ㅎㄷㄱ ㅇㅅㅇ ㄲㄴㄱㅇ...',15,114),(16,'2023-08-17 14:48:19.060533','2023-08-18 09:13:58.327383','꽃들이 기다리다 지쳐 시들겠어요.',477,'ㄲㄷㅇ ㄱㄷㄹㄷ ㅈㅊ ㅅㄷㄱㅇㅇ.',4,116),(17,'2023-08-17 14:48:19.061547','2023-08-18 00:40:55.930619','계획 미루기 연구중이신가요?',661,'ㄱㅎ ㅁㄹㄱ ㅇㄱㅈㅇㅅㄱㅇ?',8,118),(18,'2023-08-17 14:48:19.062539','2023-08-17 14:48:19.062539','오늘도 힘내보자 노예쿤...',186,'ㅇㄴㄷ ㅎㄴㅂㅈ ㄴㅇㅋ...',17,119),(19,'2023-08-17 14:57:42.476890','2023-08-18 03:54:32.916343','오늘도 화이팅해야 먹고살겠지??',2,'ㅇㄴㄷ ㅎㅇㅌㅎㅇ ㅁㄱㅅㄱㅈ??',21,2),(20,'2023-08-17 14:58:22.925315','2023-08-17 14:58:22.925315','오늘도 안하고 내일도 안하고 영영 안하겠지?',0,'ㅇㄴㄷ ㅇㅎㄱ ㄴㅇㄷ ㅇㅎㄱ ㅇㅇ ㅇㅎㄱㅈ?',21,5),(21,'2023-08-17 15:04:57.284347','2023-08-17 15:06:50.818958','마라탕 그만 머거',1,'ㅁㄹㅌ ㄱㅁ ㅁㄱ',16,124),(22,'2023-08-17 15:45:49.451327','2023-08-17 15:45:49.451327','넌 날 이길 수 없지 ㅋ',0,'ㄴ ㄴ ㅇㄱ ㅅ ㅇㅈ ㅋ',22,5),(23,'2023-08-17 15:50:20.261878','2023-08-17 15:50:20.261878','거지가 꿈이야?',0,'ㄱㅈㄱ ㄲㅇㅇ?',22,5),(24,'2023-08-17 15:54:02.849242','2023-08-17 17:26:18.167671','일어나 움직여 일어나 움직여 일어나 움직여 일어나 움직여 일어나 움직여 일어나 움직여 일어나 움직여',2,'ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ ㅇㅇㄴ ㅇㅈㅇ',22,1),(25,'2023-08-17 15:56:46.366237','2023-08-17 15:56:46.366237','밥을 먹을 여유가 있어?',0,'ㅂㅇ ㅁㅇ ㅇㅇㄱ ㅇㅇ?',21,6),(26,'2023-08-17 17:34:05.348172','2023-08-17 17:34:05.348172','I\'ll be a man',0,'I\'__ _e a _a_',30,9),(27,'2023-08-17 17:35:12.622736','2023-08-17 17:35:12.622736','``',0,'``',31,128),(28,'2023-08-17 17:35:23.464929','2023-08-17 17:35:23.464929','``',0,'``',31,129),(29,'2023-08-17 17:48:33.643329','2023-08-18 01:21:17.063969','힘내',1,'ㅎㄴ',32,6),(30,'2023-08-17 18:00:28.477462','2023-08-17 18:00:28.477462','개발 똑띠 해라',0,'ㄱㅂ ㄸㄸ ㅎㄹ',6,22),(31,'2023-08-17 18:59:11.703595','2023-08-18 09:13:22.225920','나쁜 말은 적지 않도록 항상 기억해주세요!!',0,'ㄴㅃ ㅁㅇ ㅈㅈ ㅇㄷㄹ ㅎㅅ ㄱㅇㅎㅈㅅㅇ!!',34,130),(32,'2023-08-17 19:25:55.216344','2023-08-17 19:25:55.216344','공부를 왜 안하니',0,'ㄱㅂㄹ ㅇ ㅇㅎㄴ',21,5),(33,'2023-08-17 21:26:56.755462','2023-08-18 03:53:57.427290','공부좀 하자!! 백수될라구?',2,'ㄱㅂㅈ ㅎㅈ!! ㅂㅅㄷㄹㄱ?',21,5),(34,'2023-08-17 21:28:47.335133','2023-08-17 21:28:47.335133','너는 딱 거기까지다 ㅋ',0,'ㄴㄴ ㄸ ㄱㄱㄲㅈㄷ ㅋ',21,2),(35,'2023-08-17 21:29:56.753285','2023-08-18 09:13:13.522638','너는 딱 거기까지다 ㅋㅋ',1,'ㄴㄴ ㄸ ㄱㄱㄲㅈㄷ ㅋㅋ',21,2),(36,'2023-08-17 21:40:24.986913','2023-08-17 21:40:24.986913','운동좀하자!',0,'ㅇㄷㅈㅎㅈ!',35,1),(37,'2023-08-17 21:41:57.919358','2023-08-17 21:41:57.919358','잔소리 먹고 싶지? 아이고~ 배부르겠다 ㅋ',0,'ㅈㅅㄹ ㅁㄱ ㅅㅈ? ㅇㅇㄱ~ ㅂㅂㄹㄱㄷ ㅋ',35,2),(38,'2023-08-17 23:11:36.354641','2023-08-18 09:12:05.517512','그래도 해야지 어떡해...',1,'ㄱㄹㄷ ㅎㅇㅈ ㅇㄸㅎ...',28,22),(39,'2023-08-17 23:55:22.011914','2023-08-17 23:55:22.011914','야!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 누워서 핸드폰 하는거 다 보인다!!!!!!!!!!!!!!!!!!!!',0,'ㅇ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! ㄴㅇㅅ ㅎㄷㅍ ㅎㄴㄱ ㄷ ㅂㅇㄷ!!!!!!!!!!!!!!!!!!!!',25,2),(40,'2023-08-18 00:28:58.961099','2023-08-18 00:28:58.961099','뼈가되고 살이되면 안되는데',0,'ㅃㄱㄷㄱ ㅅㅇㄷㅁ ㅇㄷㄴㄷ',3,6),(41,'2023-08-18 00:41:53.803315','2023-08-18 00:41:53.803315','오늘은 운동해라',0,'ㅇㄴㅇ ㅇㄷㅎㄹ',3,1),(42,'2023-08-18 01:31:21.810385','2023-08-18 01:38:05.934351','너의 입의 행복을 위해 너의 건강을 망가뜨리다니..',1,'ㄴㅇ ㅇㅇ ㅎㅂㅇ ㅇㅎ ㄴㅇ ㄱㄱㅇ ㅁㄱㄸㄹㄷㄴ..',26,24),(43,'2023-08-18 03:45:17.542376','2023-08-18 03:45:17.542376','정신 차리자?',0,'ㅈㅅ ㅊㄹㅈ?',21,2),(44,'2023-08-18 03:46:24.628588','2023-08-18 03:46:24.628588','아직도 안해? 이걸?',0,'ㅇㅈㄷ ㅇㅎ? ㅇㄱ?',21,5),(45,'2023-08-18 03:48:03.834109','2023-08-18 03:48:03.834109','개발을 니가 하긴 하겠냐? 또 미루겠지',0,'ㄱㅂㅇ ㄴㄱ ㅎㄱ ㅎㄱㄴ? ㄸ ㅁㄹㄱㅈ',1,22),(46,'2023-08-18 03:49:09.323076','2023-08-18 03:49:09.323076','영화를 맨날 보게?',0,'ㅇㅎㄹ ㅁㄴ ㅂㄱ?',1,105),(47,'2023-08-18 03:51:42.001628','2023-08-18 03:51:42.001628','공부를 하겠냐구 ㅋㅋ',0,'ㄱㅂㄹ ㅎㄱㄴㄱ ㅋㅋ',1,5),(48,'2023-08-18 03:53:40.540423','2023-08-18 03:53:40.540423','초성 궁금해죽겠네',0,'ㅊㅅ ㄱㄱㅎㅈㄱㄴ',21,5),(49,'2023-08-18 03:54:22.271525','2023-08-18 03:54:22.271525','마음만 먹다가 30대 된다 ㅋ',0,'ㅁㅇㅁ ㅁㄷㄱ 30ㄷ ㄷㄷ ㅋ',21,5),(50,'2023-08-18 03:55:19.366578','2023-08-18 03:55:19.366578','마음을 굳게 먹어야 할 수 있단다 ㅋ',0,'ㅁㅇㅇ ㄱㄱ ㅁㅇㅇ ㅎ ㅅ ㅇㄷㄷ ㅋ',1,2),(51,'2023-08-18 03:55:49.645247','2023-08-18 09:02:42.991513','너 할거야? 말만 하다가는 비웃음 당해 ㅋㅋ',1,'ㄴ ㅎㄱㅇ? ㅁㅁ ㅎㄷㄱㄴ ㅂㅇㅇ ㄷㅎ ㅋㅋ',1,130),(52,'2023-08-18 09:08:52.503118','2023-08-18 09:08:52.503118','잔소리 한!마!디! ㅋ',0,'ㅈㅅㄹ ㅎ!ㅁ!ㄷ! ㅋ',21,130);
/*!40000 ALTER TABLE `nag` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-08-18  9:36:21
